p3/chen.reid.hu.gaoyi.P3.org
#+TITLE: P3
#+AUTHOR: Gaoyi Hu

We basically implement the b.cup under the guide of b.grammar.

Generally, we convert the input code: loc to term, id, variable and function name.
For a struct, we define the STRUCT and its name, using the structbody to fill in its content. Formals are the part we will put the input arguments. Similiarly, for a function, we define the function name, input and using the funcbody to fill it.
On the other side, we add all variables into a list so we are able to manage the values inside the list.
For normal structres such as if, while and read, we use the stmt and stmtlist to implement them. As for the expressions, we use the exp and assign Exp to represnet them. Also, terms for bool, string and some other type. 

We use the constructor =public CallExpNode(IdNode name)= in case of function call has no parameters.
